

void Init(void)
{

}

void Exec(void) {
long sector=0;
long S1,S2;
long m1,m2,m3;
v->AskC = (*v->S1) - (*v->S2);
v->AskA = (*v->S2) + (*v->S1 >> 1);
v->AskB = - (*(v->S1)) - ((*(v->S2)) >> 1); // пор€док операций
 if(v->AskC>_IQ24(0.0)) { // справа и ниже оси фаза -—  =>  I, V, VI
    if(v->AskA > _IQ24(0.0)) //выше оси фазы A  =>  I
      sector = 1;
    else { // V,VI
       if(v->AskB > _IQ24(0.0)) // слева и ниже оси -B => V
          sector =  5;
       else
          sector =  6;
    }
 } else { // II, III, IV
    if(v->AskA < _IQ24(0.0)) //ниже оси фазы -A => IV
      sector = 4;
    else { //II,III
       if(v->AskB > _IQ24(0.0)) // справа и выше оси B => II
         sector =  3;
       else
         sector = 2;
   }
}

switch(sector) {
case 1:
S1 = *v->S1; // ток в направлении фазы ј
S2 = (*v->S1) + (*v->S2); // ток в направлении фазы -—, находим не геометрически, 
                          //а из услови€ сумма токов в узле =0
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = m2 + m3;
v->Tb = m3 - m2;
v->Tc = _IQ24mpy(m2 + m3,_IQ24(-1.0));
break;
case 2:
S1 = (*v->S1) + (*v->S2);  // ток в направлении фазы -C
S2 = *v->S2; 
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = m2 - m3;
v->Tb =  _IQ24mpy(m2 + m3,_IQ24(1.0));// _IQ24mpy(m2 + m3,_IQ24(0.5));
v->Tc = -(m2 + m3);//_IQ24mpy(m2 + m3,_IQ24(0.5));//- (m2 + m3);
break;
case 3:
S1 = (*v->S2); // это проекци€ на ось фазы B (измеренный ток фазы B)
S2 = -(*v->S1); // это проекци€ на ось фазы -A
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = _IQ24mpy(m2 + m3,_IQ24(-1.0));
v->Tb = m2 + m3;
v->Tc = m3 - m2;
break;
case 4:
S1 = -(*v->S1); // это проекци€ на ось фазы -A
S2 = -((*v->S1) + (*v->S2)); // ток в направлении фазы —, находим не геометрически
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = -(m2 + m3);
v->Tb = -(m3 - m2);
v->Tc = _IQ24mpy(m2 + m3,_IQ24(1.0));
break;
case 5:
S1 = -((*v->S1) + (*v->S2)); // ток в направлении фазы —, находим не геометрически
S2 = -(*v->S2); 
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = -(m2 - m3);
v->Tb =  _IQ24mpy(m2 + m3,_IQ24(-1.0));// _IQ24mpy(m2 + m3,_IQ24(0.5));
v->Tc = (m2 + m3);//_IQ24mpy(m2 + m3,_IQ24(0.5));//- (m2 + m3);
break;
case 6:
S1 = -(*v->S2); 
S2 = (*v->S1); // проекци€ на ось ј
m2 = _IQ24mpy(S1 - (S2>>1),_IQ24(1.333));
m3 = _IQ24mpy(S2 - (S1>>1),_IQ24(1.333));
v->Ta = _IQ24mpy(m2 + m3,_IQ24(1.0));
v->Tb = -(m2 + m3);
v->Tc = -(m3 - m2);
break;
}
}
